In [3]:
import pandas as pd
import numpy as np

In [6]:
d = {
    'Name':['Alisa','John','Cathrine','Alisa','John','Cathrine',
            'Alisa','John','Cathrine','Alisa','John','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df = pd.DataFrame(d)
df

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1       John  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4       John  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7       John  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [8]:
res = df.groupby(['Subject','Exam'])['Score'].sum()
res

Subject      Exam
Mathematics  Semester 1    164
             Semester 2    190
Science      Semester 1    182
             Semester 2    237
Name: Score, dtype: int64

In [9]:
type(res)
# res.index

pandas.core.series.Series

In [10]:
df['Name'].value_counts()

Alisa       4
John        4
Cathrine    4
Name: Name, dtype: int64

In [11]:
df['Subject'].value_counts()

Science        6
Mathematics    6
Name: Subject, dtype: int64

In [13]:
df['Exam'].value_counts()

Semester 1    6
Semester 2    6
Name: Exam, dtype: int64

### Pivot Table

Default aggregate function is mean

In [14]:
df

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1       John  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4       John  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7       John  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [17]:
print(62+47+55)
print(74+31+77)
print((62+47+55)/3)
print((74+31+77)/3)
print(67+89+81)

164
182
54.666666666666664
60.666666666666664
237

In [10]:
df.columns

Index(['Name', 'Exam', 'Subject', 'Score'], dtype='object')

In [23]:
# Name, Exam
d1 = pd.pivot_table(df,index='Exam',columns='Subject',values='Score')
# values = ['a','b','c']
d1

Subject     Mathematics    Science
Exam
Semester 1    54.666667  60.666667
Semester 2    63.333333  79.000000

In [24]:
# d1['Mathematics'] = round(d1['Mathematics'],2)
# d1.head()

In [25]:
d1 = pd.pivot_table(df,index='Subject',columns='Exam')
d1

                 Score
Exam        Semester 1 Semester 2
Subject
Mathematics  54.666667  63.333333
Science      60.666667  79.000000

In [30]:
d2 = pd.pivot_table(df,index='Exam',columns='Subject',
                    values='Score',aggfunc='max')
# aggfunc = max/ min/ sum/ count/ mean
d2

Subject     Mathematics  Science
Exam
Semester 1           62       77
Semester 2           85       89

In [31]:
df

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1       John  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4       John  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7       John  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [33]:
print(df['Score'][df['Exam']=='Semester 1'].mean())
print(df['Score'][df['Exam']=='Semester 2'].mean())

57.666666666666664
71.16666666666667

In [37]:
d3 = pd.pivot_table(df,index='Exam',values='Score')
d3

                Score
Exam
Semester 1  57.666667
Semester 2  71.166667

In [36]:
d4 = pd.pivot_table(df,columns='Exam',values='Score')
d4

Exam   Semester 1  Semester 2
Score   57.666667   71.166667

In [41]:
print(df['Score'][df['Subject']=='Science'].mean())
print(df['Score'][df['Subject']=='Mathematics'].mean())

69.83333333333333
59.0

In [46]:
w1 = df.query("Subject=='Science'")
print(w1['Score'].mean())
w1

69.83333333333333

        Name        Exam  Subject  Score
3      Alisa  Semester 1  Science     74
4       John  Semester 1  Science     31
5   Cathrine  Semester 1  Science     77
9      Alisa  Semester 2  Science     67
10      John  Semester 2  Science     89
11  Cathrine  Semester 2  Science     81

In [56]:
d5 = pd.pivot_table(df,index='Subject')
d5

                 Score
Subject
Mathematics  59.000000
Science      69.833333

In [58]:
d6 = pd.pivot_table(df,columns='Subject')
d6

Subject  Mathematics    Science
Score           59.0  69.833333

In [60]:
df

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1       John  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4       John  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7       John  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10      John  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [64]:
df.shape

(12, 4)

In [63]:
d9 = pd.pivot_table(df,columns='Name',index=['Exam','Subject'])
d9

                       Score
Name                   Alisa Cathrine John
Exam       Subject
Semester 1 Mathematics    62       55   47
           Science        74       77   31
Semester 2 Mathematics    85       42   63
           Science        67       81   89

In [65]:
d10 = pd.pivot_table(df,index='Name',columns=['Exam','Subject'])
d10

               Score
Exam      Semester 1          Semester 2
Subject  Mathematics Science Mathematics Science
Name
Alisa             62      74          85      67
Cathrine          55      77          42      81
John              47      31          63      89

### Stack and Unstack

Stack = Columns -> index<br>
Unstack = Index -> Columns

<img src="stack_unstack_pt.png">

In [79]:
d1 = pd.pivot_table(df,index='Exam',columns=['Subject','Name'],
                    values='Score')
d1

Subject    Mathematics               Science
Name             Alisa Cathrine John   Alisa Cathrine John
Exam
Semester 1          62       55   47      74       77   31
Semester 2          85       42   63      67       81   89

In [83]:
d1.stack(level=-2)

Name                    Alisa  Cathrine  John
Exam       Subject
Semester 1 Mathematics     62        55    47
           Science         74        77    31
Semester 2 Mathematics     85        42    63
           Science         67        81    89

In [88]:
d2 = pd.pivot_table(df,columns='Exam',index=['Subject','Name'],values='Score')
d2

Exam                  Semester 1  Semester 2
Subject     Name
Mathematics Alisa             62          85
            Cathrine          55          42
            John              47          63
Science     Alisa             74          67
            Cathrine          77          81
            John              31          89

In [91]:
d2.unstack(level=-2)

Exam      Semester 1          Semester 2
Subject  Mathematics Science Mathematics Science
Name
Alisa             62      74          85      67
Cathrine          55      77          42      81
John              47      31          63      89

### Notes
1) For Multi Index, Multi Column dataframe, pivot table is used.<br>
2) stack() = Columns -> Index<br>
3) unstack() = index -> columns<br>
4) By default in stack and unstack operations, index and columns when interchanged are added to the innermost columns and/ or index respectively<br>
5) With different level, we do have the privilege to chose the column or index to stack or unstack.<br>
6) The outermost index or column is assigned a level=0 and it proceeds in the positive direction as we move inwards<br>
7) The innermost index or column is assigned a level=-1 and it proceeds in the negative direction as we move outwards<br>

### Datetime Handling in Pandas

In [93]:
import pandas as pd

In [95]:
# YYYY-MM-DD
d = {'DateVal':['2018-03-19','2017-07-06','2021-01-01','2021-12-30'],
     'Product' :['Cup','Basket','Lamp','Bowl'],
     'Sales':[3400,6500,4980,7650],
     'CA':['Yes','No','No','Yes'],
    }
# CA = Currently Available
df = pd.DataFrame(d)
df

      DateVal Product  Sales   CA
0  2018-03-19     Cup   3400  Yes
1  2017-07-06  Basket   6500   No
2  2021-01-01    Lamp   4980   No
3  2021-12-30    Bowl   7650  Yes

In [96]:
df.dtypes

DateVal    object
Product    object
Sales       int64
CA         object
dtype: object

In [97]:
# dt = datetime
df['Date'] = df['DateVal'].dt.day
df['Month'] = df['DateVal'].dt.month
df['Year'] = df['DateVal'].dt.year

AttributeError: Can only use .dt accessor with datetimelike values

In [100]:
df['DateVal'] = pd.to_datetime(df['DateVal'])
df.dtypes

DateVal    datetime64[ns]
Product            object
Sales               int64
CA                 object
dtype: object

In [101]:
df['Year'] = df['DateVal'].dt.year
df['Quarter'] = df['DateVal'].dt.quarter
df['Month'] = df['DateVal'].dt.month
df['Date'] = df['DateVal'].dt.day
df

     DateVal Product  Sales   CA  Year  Quarter  Month  Date
0 2018-03-19     Cup   3400  Yes  2018        1      3    19
1 2017-07-06  Basket   6500   No  2017        3      7     6
2 2021-01-01    Lamp   4980   No  2021        1      1     1
3 2021-12-30    Bowl   7650  Yes  2021        4     12    30

In [109]:
d ={'Date':['2022-04-18','2022-04-19','2022-04-20','2022-04-21','2022-04-22',
            '2022-04-23','2022-04-24']}

df_new = pd.DataFrame(d)
df_new

         Date
0  2022-04-18
1  2022-04-19
2  2022-04-20
3  2022-04-21
4  2022-04-22
5  2022-04-23
6  2022-04-24

In [110]:
df_new.dtypes

Date    object
dtype: object

In [111]:
df_new['Date'] = pd.to_datetime(df_new['Date'])
df_new.dtypes

Date    datetime64[ns]
dtype: object

In [112]:
df_new['Year'] = df_new['Date'].dt.year
df_new['Quarter'] = df_new['Date'].dt.quarter
df_new['Month'] = df_new['Date'].dt.month
df_new

        Date  Year  Quarter  Month
0 2022-04-18  2022        2      4
1 2022-04-19  2022        2      4
2 2022-04-20  2022        2      4
3 2022-04-21  2022        2      4
4 2022-04-22  2022        2      4
5 2022-04-23  2022        2      4
6 2022-04-24  2022        2      4

In [113]:
df_new['Day'] = df_new['Date'].dt.day
df_new['Week'] = df_new['Date'].dt.week
df_new['Day_of_Week'] = df_new['Date'].dt.dayofweek
# 0-6. 0-Mon, 1-Tue, 6-Sun
df_new

<ipython-input-113-60aaa689ae2f>:2: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df_new['Week'] = df_new['Date'].dt.week

        Date  Year  Quarter  Month  Day  Week  Day_of_Week
0 2022-04-18  2022        2      4   18    16            0
1 2022-04-19  2022        2      4   19    16            1
2 2022-04-20  2022        2      4   20    16            2
3 2022-04-21  2022        2      4   21    16            3
4 2022-04-22  2022        2      4   22    16            4
5 2022-04-23  2022        2      4   23    16            5
6 2022-04-24  2022        2      4   24    16            6

### Note
Weekday_Name column is generated based on the the Day_of_Week columns where the individual day values are replace with weekday names

In [114]:
df_new['Weekday_Name'] = df_new['Day_of_Week'].replace({0:'Mon',1:'Tue',2:'Wed',3:'Thu',
                                                       4:'Fri',5:'Sat',6:'Sun'})
df_new

        Date  Year  Quarter  Month  Day  Week  Day_of_Week Weekday_Name
0 2022-04-18  2022        2      4   18    16            0          Mon
1 2022-04-19  2022        2      4   19    16            1          Tue
2 2022-04-20  2022        2      4   20    16            2          Wed
3 2022-04-21  2022        2      4   21    16            3          Thu
4 2022-04-22  2022        2      4   22    16            4          Fri
5 2022-04-23  2022        2      4   23    16            5          Sat
6 2022-04-24  2022        2      4   24    16            6          Sun